[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 1000,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Acoustic guitar classes for complete beginners. Learn essential chords, strumming patterns, and simple songs. Each session includes hands-on practice, tips for improving finger positioning, and guidance on how to read basic music notation. Perfect for those who want to start their musical journey with confidence.",
    "image": "https://i.ibb.co.com/7JgJv7T1/Guitar-Lessons-Beginners-Hero.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 1000,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Conversational English sessions for non-native speakers. Practice real-life conversations, improve pronunciation, and expand your vocabulary. Sessions focus on speaking fluency, listening skills, and confidence building. Suitable for beginners and intermediate learners who want to communicate effectively in everyday situations.",
    "image": "https://i.ibb.co.com/7dJKvhN6/images.png",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "Python Programming Basics",
    "providerName": "Rafiq Ahmed",
    "providerEmail": "rafiq@skillswap.com",
    "price": 2500,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Learn Python programming from scratch with hands-on exercises. Understand the fundamentals including variables, loops, conditional statements, functions, and data structures. By the end of the course, you will build simple projects to reinforce your learning and gain confidence to pursue intermediate programming topics.",
    "image": "https://i.ibb.co.com/BVJNPLKn/images.png",
    "category": "Programming"
  },
  {
    "skillId": 4,
    "skillName": "Digital Photography Essentials",
    "providerName": "Lina Roy",
    "providerEmail": "lina@skillswap.com",
    "price": 800,
    "rating": 4.7,
    "slotsAvailable": 2,
    "description": "Master the basics of digital photography and photo editing. Learn camera settings, composition techniques, lighting, and framing to capture stunning images. Gain practical experience in photo editing software to enhance your photos. Ideal for beginners who want to take professional-looking pictures with any camera.",
    "image": "https://i.ibb.co.com/Fqz2gWP2/images.jpg",
    "category": "Photography"
  },
  {
    "skillId": 5,
    "skillName": "Yoga for Beginners",
    "providerName": "Imran Khan",
    "providerEmail": "imran@skillswap.com",
    "price": 1500,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Learn basic yoga postures and breathing techniques for daily wellness. Sessions include gentle stretches, beginner-friendly poses, and relaxation methods. Improve flexibility, balance, and mental clarity. Ideal for anyone looking to reduce stress, improve posture, and start a consistent wellness routine at home.",
    "image": "https://i.ibb.co.com/ST8y78F/yoga-for-men-1596033086-1600263040.jpg",
    "category": "Fitness"
  },
  {
    "skillId": 6,
    "skillName": "Basic Cooking Techniques",
    "providerName": "Nadia Akter",
    "providerEmail": "nadia@skillswap.com",
    "price": 800,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Hands-on sessions on essential cooking skills for everyday meals. Learn knife skills, basic cooking techniques, seasoning tips, and recipe preparation. Each session is designed to help beginners cook confidently and prepare nutritious meals efficiently. Perfect for those starting to explore home cooking.",
    "image": "https://i.ibb.co.com/93Y3FyvL/images-2.jpg",
    "category": "Culinary"
  },
  {
    "skillId": 7,
    "skillName": "Advanced Excel Training",
    "providerName": "Fahim Chowdhury",
    "providerEmail": "fahim@skillswap.com",
    "price": 620,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "Learn advanced Excel formulas, pivot tables, and data analysis techniques. Gain skills in VLOOKUP, INDEX-MATCH, conditional formatting, macros, and charts. Suitable for professionals, students, or anyone looking to enhance productivity and make data-driven decisions with Excel.",
    "image": "https://i.ibb.co.com/GvbmyHtx/Advanced-Excel-Training-Learn-the-Best-Techniques-of-the-Excel.jpg",
    "category": "Software"
  },
  {
    "skillId": 8,
    "skillName": "Creative Writing Workshop",
    "providerName": "Maya Sen",
    "providerEmail": "maya@skillswap.com",
    "price": 1200,
    "rating": 4.9,
    "slotsAvailable": 5,
    "description": "Enhance storytelling, poetry, and essay writing skills through structured exercises and feedback. Learn narrative techniques, character development, and effective editing. Suitable for beginners and intermediate writers who want to improve creativity, clarity, and expression in their writing.",
    "image": "https://i.ibb.co.com/60CSVPk4/images-3.jpg",
    "category": "Writing"
  },
  {
    "skillId": 9,
    "skillName": "Basic Spanish Conversation",
    "providerName": "Carlos Diaz",
    "providerEmail": "carlos@skillswap.com",
    "price": 1500,
    "rating": 4.6,
    "slotsAvailable": 3,
    "description": "Learn basic Spanish speaking and listening skills for daily interactions. Focus on vocabulary, common phrases, and pronunciation. Practice real-life scenarios such as ordering food, introducing yourself, and asking for directions. Perfect for travelers or beginners looking to start communicating in Spanish confidently.",
    "image": "https://i.ibb.co.com/qZBLJ0b/images-4.jpg",
    "category": "Language"
  },
  {
    "skillId": 10,
    "skillName": "Web Development Fundamentals",
    "providerName": "Tania Rahman",
    "providerEmail": "tania@skillswap.com",
    "price": 3500,
    "rating": 4.8,
    "slotsAvailable": 2,
    "description": "Learn HTML, CSS, and JavaScript basics to build your first websites. Understand web page structure, styling, and interactive elements. Hands-on exercises allow you to create functional web pages, preparing you for more advanced web development topics.",
    "image": "https://i.ibb.co.com/Pz0Y6VpD/The-Fundamentals-of-Front-End-Web-Development.png",
    "category": "Programming"
  },
  {
    "skillId": 11,
    "skillName": "Calligraphy for Beginners",
    "providerName": "Rina Das",
    "providerEmail": "rina@skillswap.com",
    "price": 1800,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Learn the art of decorative writing and calligraphy techniques. Practice different scripts, brush and pen control, and creative lettering styles. Suitable for beginners who want to create personalized cards, invitations, or artworks with beautiful handwriting.",
    "image": "https://i.ibb.co.com/shNbzPW/images-5.jpg",
    "category": "Art"
  },
  {
    "skillId": 12,
    "skillName": "Public Speaking Essentials",
    "providerName": "Shahriar Islam",
    "providerEmail": "shahriar@skillswap.com",
    "price": 2000,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "Gain confidence and clarity in public speaking. Learn speech preparation, body language, voice modulation, and audience engagement techniques. Practice delivering speeches in a supportive environment and receive constructive feedback to improve communication skills.",
    "image": "https://i.ibb.co.com/mVLrccZ5/download.jpg",
    "category": "Communication"
  },
  {
    "skillId": 13,
    "skillName": "Mobile Photography Tips",
    "providerName": "Anika Chowdhury",
    "providerEmail": "anika@skillswap.com",
    "price": 1500,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Learn how to take stunning photos using your smartphone. Topics include composition, lighting, perspective, and editing apps. Improve your visual storytelling skills and capture memorable moments with clarity and style. Perfect for social media enthusiasts and hobby photographers.",
    "image": "https://i.ibb.co.com/b58djGW5/download-1.jpg",
    "category": "Photography"
  },
  {
    "skillId": 14,
    "skillName": "Interior Design Basics",
    "providerName": "Rafi Ahmed",
    "providerEmail": "rafi@skillswap.com",
    "price": 900,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Introduction to designing and decorating living spaces. Learn about color schemes, furniture placement, lighting, and space utilization. Gain practical tips for creating aesthetically pleasing and functional interiors. Suitable for beginners and DIY enthusiasts.",
    "image": "https://i.ibb.co.com/Q3nJFHkz/interior-basics-scale.jpg",
    "category": "Design"
  },
  {
    "skillId": 15,
    "skillName": "Meditation and Mindfulness",
    "providerName": "Leena Das",
    "providerEmail": "leena@skillswap.com",
    "price": 1200,
    "rating": 4.9,
    "slotsAvailable": 6,
    "description": "Guided meditation sessions for stress relief and mental clarity. Learn breathing techniques, mindfulness practices, and focus exercises to calm the mind. Improve sleep, concentration, and emotional well-being. Perfect for beginners seeking inner peace and daily mental balance.",
    "image": "https://i.ibb.co.com/XZWQBv3R/download-2.jpg",
    "category": "Wellness"
  }
  
]
